thesofproject/sof/src/debug/shell/esp32_shell.c
	bool enable = (strcmp(argv[1], "on") == 0 || strcmp(argv[1], "1") == 0 || strcmp(argv[1], "start") == 0);
	usb_audio_set_tone(enable);
	shell_print(sh, "Test tone generator set to %s.", enable ? "ON" : "OFF");
	return 0;
}

static int cmd_sof_cap(const struct shell *sh, size_t argc, char **argv)
{
	if (argc < 2) {
		shell_error(sh, "Usage: sof cap <start|stop>");
		return -EINVAL;
	}

	bool start = (strcmp(argv[1], "start") == 0);
	sof_static_pipeline_set_capture_active(start);
	shell_print(sh, "Capture pipeline %s.", start ? "STARTED" : "STOPPED");
	return 0;
}

static int cmd_sof_ctl(const struct shell *sh, size_t argc, char **argv)
{
	const struct sof_static_topology *topo = sof_static_topology_get();
	if (!topo) {
		shell_error(sh, "No active static topology");
		return -ENODEV;
	}

	if (argc < 2 || strcmp(argv[1], "list") == 0) {
		shell_print(sh, "=== SOF Static Topology Controls (%s) ===", topo->name ? topo->name : "");
		shell_print(sh, "%-4s %-28s %-6s %-10s %s", "ID", "Name", "Comp", "Type", "Value");
		shell_print(sh, "-------------------------------------------------------------");
		for (size_t i = 0; i < topo->num_controls; i++) {
			const struct sof_static_kcontrol *ctl = &topo->controls[i];
			int32_t val = 0;
			sof_static_kcontrol_get(ctl->id, &val);
			const char *type_str = (ctl->type == SOF_STATIC_CTRL_VOLUME) ? "VOLUME" :
					       (ctl->type == SOF_STATIC_CTRL_SWITCH) ? "SWITCH" :
					       (ctl->type == SOF_STATIC_CTRL_ENUM) ? "ENUM" : "BINARY";
			shell_print(sh, "[%2u] %-28s comp:%-2u %-10s %d (0x%08x)",
				    ctl->id, ctl->name, ctl->target_comp_id, type_str, val, (uint32_t)val);
		}
		return 0;
	}

	if (strcmp(argv[1], "get") == 0) {
		if (argc < 3) {
			shell_error(sh, "Usage: sof ctl get <id|name>");
			return -EINVAL;
		}
		int ctrl_id = atoi(argv[2]);
		if (ctrl_id == 0 && strcmp(argv[2], "0") != 0) {
			ctrl_id = sof_static_kcontrol_find_by_name(argv[2]);
		}
		if (ctrl_id <= 0) {
			shell_error(sh, "Control not found: %s", argv[2]);
			return -ENOENT;
		}
		int32_t val = 0;
		int ret = sof_static_kcontrol_get((uint32_t)ctrl_id, &val);
		if (ret < 0) {
			shell_error(sh, "Failed to get control %d (ret %d)", ctrl_id, ret);
			return ret;
		}
		shell_print(sh, "Control [%d] value = %d (0x%x)", ctrl_id, val, (uint32_t)val);
		return 0;
	}

	if (strcmp(argv[1], "set") == 0) {
		if (argc < 4) {
			shell_error(sh, "Usage: sof ctl set <id|name> <value>");
			return -EINVAL;
		}
		int ctrl_id = atoi(argv[2]);
		if (ctrl_id == 0 && strcmp(argv[2], "0") != 0) {
			ctrl_id = sof_static_kcontrol_find_by_name(argv[2]);
		}
		if (ctrl_id <= 0) {
			shell_error(sh, "Control not found: %s", argv[2]);
			return -ENOENT;
		}
		int32_t val = (int32_t)strtol(argv[3], NULL, 0);
		int ret = sof_static_kcontrol_set((uint32_t)ctrl_id, val);
		if (ret < 0) {
			shell_error(sh, "Failed to set control %d (ret %d)", ctrl_id, ret);
			return ret;
		}
		shell_print(sh, "Control [%d] set to %d (0x%x)", ctrl_id, val, (uint32_t)val);
		return 0;
	}

	shell_error(sh, "Usage: sof ctl <list|get|set> [args]");
	return -EINVAL;
}

static int cmd_sof_regs(const struct shell *sh, size_t argc, char **argv)
{
	ARG_UNUSED(argc);
	ARG_UNUSED(argv);

	shell_print(sh, "=== I2S0 / PDM Registers ===");
	shell_print(sh, "  I2S0.tx_conf:         0x%08x (tx_start=%u, tx_pdm_en=%u, tx_tdm_en=%u, tx_slave=%u, bck_div=%u)",
		(uint32_t)I2S0.tx_conf.val,
		(uint32_t)I2S0.tx_conf.tx_start,
		(uint32_t)I2S0.tx_conf.tx_pdm_en,
		(uint32_t)I2S0.tx_conf.tx_tdm_en,
		(uint32_t)I2S0.tx_conf.tx_slave_mod,
		(uint32_t)I2S0.tx_conf.tx_bck_div_num);
	shell_print(sh, "  I2S0.tx_pcm2pdm_conf: 0x%08x (conv_en=%u, osr2=%u, dac_en=%u, dac_2out=%u)",
		(uint32_t)I2S0.tx_pcm2pdm_conf.val,
		(uint32_t)I2S0.tx_pcm2pdm_conf.pcm2pdm_conv_en,
		(uint32_t)I2S0.tx_pcm2pdm_conf.tx_pdm_sinc_osr2,
		(uint32_t)I2S0.tx_pcm2pdm_conf.tx_pdm_dac_mode_en,
		(uint32_t)I2S0.tx_pcm2pdm_conf.tx_pdm_dac_2out_en);
	shell_print(sh, "  I2S0.tx_pcm2pdm_conf1:0x%08x (fp=%u, fs=%u)",
		(uint32_t)I2S0.tx_pcm2pdm_conf1.val,
		(uint32_t)I2S0.tx_pcm2pdm_conf1.tx_pdm_fp,
		(uint32_t)I2S0.tx_pcm2pdm_conf1.tx_pdm_fs);
	shell_print(sh, "  I2S0.tx_conf1:        0x%08x (bits_mod=%u, chan_bits=%u, half_bits=%u)",
		(uint32_t)I2S0.tx_conf1.val,
		(uint32_t)I2S0.tx_conf1.tx_bits_mod,
		(uint32_t)I2S0.tx_conf1.tx_tdm_chan_bits,
		(uint32_t)I2S0.tx_conf1.tx_half_sample_bits);
	shell_print(sh, "  I2S0.rx_conf:         0x%08x (rx_start=%u, rx_pdm_en=%u, rx_tdm_en=%u, rx_slave=%u)",
		(uint32_t)I2S0.rx_conf.val,
		(uint32_t)I2S0.rx_conf.rx_start,
		(uint32_t)I2S0.rx_conf.rx_pdm_en,
		(uint32_t)I2S0.rx_conf.rx_tdm_en,
		(uint32_t)I2S0.rx_conf.rx_slave_mod);
	shell_print(sh, "  I2S0.rx_conf1:        0x%08x (bits_mod=%u, chan_bits=%u, half_bits=%u)",
		(uint32_t)I2S0.rx_conf1.val,
		(uint32_t)I2S0.rx_conf1.rx_bits_mod,
		(uint32_t)I2S0.rx_conf1.rx_tdm_chan_bits,
		(uint32_t)I2S0.rx_conf1.rx_half_sample_bits);
	shell_print(sh, "  I2S0.rx_pdm2pcm_conf: 0x%08x (conv_en=%u, dsr16=%u, amp=%u)",
		(uint32_t)I2S0.rx_pdm2pcm_conf.val,
		(uint32_t)I2S0.rx_pdm2pcm_conf.rx_pdm2pcm_en,
		(uint32_t)I2S0.rx_pdm2pcm_conf.rx_pdm_sinc_dsr_16_en,
		(uint32_t)I2S0.rx_pdm2pcm_conf.rx_pdm2pcm_amplify_num);
	shell_print(sh, "  GPIO Matrix:          G3_out=0x%08x (sel=%u), G4_out=0x%08x (sel=%u), G5_out=0x%08x (sel=%u)",
		(uint32_t)GPIO.func_out_sel_cfg[3].val,
		(uint32_t)GPIO.func_out_sel_cfg[3].out_sel,
		(uint32_t)GPIO.func_out_sel_cfg[4].val,
		(uint32_t)GPIO.func_out_sel_cfg[4].out_sel,
		(uint32_t)GPIO.func_out_sel_cfg[5].val,
		(uint32_t)GPIO.func_out_sel_cfg[5].out_sel);
	shell_print(sh, "  GPIO Level / In:      GPIO_IN=0x%08x, G3_in=%u, G4_in=%u, G5_in=%u",
		(uint32_t)GPIO.in.val,
		(uint32_t)((GPIO.in.val >> 3) & 1),
		(uint32_t)((GPIO.in.val >> 4) & 1),
		(uint32_t)((GPIO.in.val >> 5) & 1));
	shell_print(sh, "  IO_MUX:               IO_MUX[3]=0x%08x, IO_MUX[4]=0x%08x, IO_MUX[5]=0x%08x",
		(uint32_t)IO_MUX.gpio[3].val,
		(uint32_t)IO_MUX.gpio[4].val,
		(uint32_t)IO_MUX.gpio[5].val);
	shell_print(sh, "  HP_SYS_CLKRST:        ctrl11=0x%08x (rx_src=%u), ctrl13=0x%08x (tx_src=%u, tx_div_n=%u)",
		(uint32_t)HP_SYS_CLKRST.peri_clk_ctrl11.val,
		(uint32_t)HP_SYS_CLKRST.peri_clk_ctrl11.reg_i2s0_rx_clk_src_sel,
		(uint32_t)HP_SYS_CLKRST.peri_clk_ctrl13.val,
		(uint32_t)HP_SYS_CLKRST.peri_clk_ctrl13.reg_i2s0_tx_clk_src_sel,
		(uint32_t)HP_SYS_CLKRST.peri_clk_ctrl13.reg_i2s0_tx_div_n);
	shell_print(sh, "============================");
	return 0;
}

static int cmd_sof_bt_status(const struct shell *sh, size_t argc, char **argv)
{
	ARG_UNUSED(argc);
	ARG_UNUSED(argv);

