thesofproject/sof/src/debug/shell/esp32_shell.c
	struct bt_service_status st;
	bt_service_get_status(&st);
	const struct bt_audio_format_desc *desc = bt_service_get_current_format_desc();

	shell_print(sh, "=== Bluetooth LE Audio / C6 Co-Processor Status ===");
	shell_print(sh, "  ESP32-C6 Power:    %s (GPIO 54 asserted)", st.c6_powered ? "ON" : "OFF");
	shell_print(sh, "  Link State:        %s",
		    st.state == BT_STATE_DISABLED ? "DISABLED" :
		    (st.state == BT_STATE_READY ? "READY" :
		    (st.state == BT_STATE_BROADCASTING ? "BROADCASTING" :
		    (st.state == BT_STATE_RECEIVING ? "RECEIVING" : "SCANNING"))));
	shell_print(sh, "  Active Format:     %s (%s)", desc ? desc->name : "unknown", desc ? desc->codec_name : "LC3");
	shell_print(sh, "  Audio Quality:     %u Hz, %u-bit stereo, %u kbps (%u.%u ms SDU, %u B PCM)",
		    st.sample_rate, desc ? desc->bit_depth : 16, st.bitrate_kbps,
		    desc ? (desc->frame_duration_us / 1000) : 10,
		    desc ? ((desc->frame_duration_us % 1000) / 100) : 0,
		    st.frame_bytes);
	shell_print(sh, "  TX Packets / Bytes:%u pkts / %u bytes", st.tx_packets, st.tx_bytes);
	shell_print(sh, "  RX Packets / Bytes:%u pkts / %u bytes", st.rx_packets, st.rx_bytes);
	shell_print(sh, "  Link RSSI:         %d dBm", st.rssi);
	shell_print(sh, "====================================================");
	return 0;
}

static int cmd_sof_bt_format(const struct shell *sh, size_t argc, char **argv)
{
	if (argc < 2) {
		enum bt_audio_format current = bt_service_get_format();
		shell_print(sh, "=== Available Bluetooth Audio Formats ===");
		shell_print(sh, "  ID | Format Key | Codec      | Sample Rate | Bits | Frame | Bitrate  | Frame PCM");
		shell_print(sh, "-----+------------+------------+-------------+------+-------+----------+----------");
		for (int i = 0; i < BT_AUDIO_FMT_COUNT; i++) {
			const struct bt_audio_format_desc *d = bt_service_get_format_desc((enum bt_audio_format)i);
			if (!d) continue;
			char cur_mark = (i == (int)current) ? '*' : ' ';
			shell_print(sh, " %c%d | %-10s | %-10s | %6u Hz   | %2u   | %2u.%1u ms| %4u kbps| %5u B",
				    cur_mark, i, d->name, d->codec_name, d->sample_rate, d->bit_depth,
				    d->frame_duration_us / 1000, (d->frame_duration_us % 1000) / 100,
				    d->bitrate_kbps, d->frame_bytes);
		}
		shell_print(sh, "=========================================");
		shell_print(sh, "Usage: sof bt format <name|id>");
		return 0;
	}

	enum bt_audio_format target_fmt;
	char *endptr;
	long val = strtol(argv[1], &endptr, 10);
	if (*endptr == '\0' && val >= 0 && val < BT_AUDIO_FMT_COUNT) {
		target_fmt = (enum bt_audio_format)val;
	} else if (bt_service_format_from_name(argv[1], &target_fmt) != 0) {
		shell_error(sh, "Unknown format: %s. Run 'sof bt format' to see available formats.", argv[1]);
		return -EINVAL;
	}

	sof_static_kcontrol_set(14, (int32_t)target_fmt);
	const struct bt_audio_format_desc *desc = bt_service_get_format_desc(target_fmt);
	shell_print(sh, "Bluetooth audio format switched to: %s (%s @ %u Hz, %u kbps)",
		    desc->name, desc->codec_name, desc->sample_rate, desc->bitrate_kbps);
	return 0;
}

static int cmd_sof_bt_broadcast(const struct shell *sh, size_t argc, char **argv)
{
	if (argc < 2) {
		shell_error(sh, "Usage: sof bt broadcast <start|stop>");
		return -EINVAL;
	}

	if (strcmp(argv[1], "start") == 0) {
		sof_static_kcontrol_set(8, 1);
		shell_print(sh, "Bluetooth LE Audio broadcast started.");
	} else if (strcmp(argv[1], "stop") == 0) {
		sof_static_kcontrol_set(8, 0);
		shell_print(sh, "Bluetooth LE Audio broadcast stopped.");
	} else {
		shell_error(sh, "Invalid argument: %s (choose start or stop)", argv[1]);
		return -EINVAL;
	}
	return 0;
}

static int cmd_sof_bt_scan(const struct shell *sh, size_t argc, char **argv)
{
	ARG_UNUSED(argc);
	ARG_UNUSED(argv);

	bt_service_start_scan();
	shell_print(sh, "Scanning for nearby LE Audio broadcast sources...");
	return 0;
}

static int cmd_sof_bt_power(const struct shell *sh, size_t argc, char **argv)
{
	if (argc < 2) {
		shell_error(sh, "Usage: sof bt power <on|off>");
		return -EINVAL;
	}

	bool on = (strcmp(argv[1], "on") == 0 || strcmp(argv[1], "1") == 0);
	bt_service_power_c6(on);
	shell_print(sh, "ESP32-C6 power %s.", on ? "ON" : "OFF");
	return 0;
}

static int cmd_sof_route(const struct shell *sh, size_t argc, char **argv)
{
	if (argc < 2) {
		struct sof_static_pipeline_status status;
		sof_static_pipeline_get_status(&status);
		shell_print(sh, "Current Audio Route: %s",
			    status.audio_route == SOF_AUDIO_ROUTE_USB_DAI ? "USB <-> DAI (Default)" :
			    (status.audio_route == SOF_AUDIO_ROUTE_BT_DAI ? "BT <-> DAI" : "USB <-> BT"));
		shell_print(sh, "Usage: sof route <usb_dai|bt_dai|usb_bt>");
		return 0;
	}

	enum sof_audio_route route;
	if (strcmp(argv[1], "usb_dai") == 0 || strcmp(argv[1], "dai") == 0 || strcmp(argv[1], "0") == 0) {
		route = SOF_AUDIO_ROUTE_USB_DAI;
	} else if (strcmp(argv[1], "bt_dai") == 0 || strcmp(argv[1], "bt") == 0 || strcmp(argv[1], "1") == 0) {
		route = SOF_AUDIO_ROUTE_BT_DAI;
	} else if (strcmp(argv[1], "usb_bt") == 0 || strcmp(argv[1], "2") == 0) {
		route = SOF_AUDIO_ROUTE_USB_BT;
	} else {
		shell_error(sh, "Invalid route: %s (choose usb_dai, bt_dai, or usb_bt)", argv[1]);
		return -EINVAL;
	}

	sof_static_kcontrol_set(10, (int32_t)route);
	shell_print(sh, "Audio route set to %s.",
		    route == SOF_AUDIO_ROUTE_USB_DAI ? "USB <-> DAI (Default)" :
		    (route == SOF_AUDIO_ROUTE_BT_DAI ? "BT <-> DAI" : "USB <-> BT"));
	return 0;
}

#if defined(CONFIG_SOC_SERIES_ESP32P4) || defined(CONFIG_ESP32P4_PIE_SIMD)
#include <sof/math/esp32p4_pie.h>

static int cmd_sof_bench(const struct shell *sh, size_t argc, char **argv)
{
	esp_pie_enable();

	shell_print(sh, "=== ESP32-P4 PIE SIMD Audio Kernel Benchmark ===");

	#define BENCH_SAMPLES 512
	static int16_t src[BENCH_SAMPLES] __attribute__((aligned(16)));
	static int16_t dst_scalar[BENCH_SAMPLES] __attribute__((aligned(16)));
	static int16_t dst_pie[BENCH_SAMPLES] __attribute__((aligned(16)));

	/* Initialize test samples with ramp waveform */
	for (int i = 0; i < BENCH_SAMPLES; i++) {
		src[i] = (int16_t)((i % 128) * 256 - 16384);
	}

	const int32_t vol_l = 32768; /* -6 dB */
	const int32_t vol_r = 16384; /* -12 dB */
	const int iters = 200;

